{
  "1":{
    "0":"Давай научимся перемещаться по игровому полю! Твоя задача дойти до обозначенной зеленым цветом ячейки. Чтобы увидеть следующие подсказки, кликни по моему портрету.",
    "1":"Чтобы перемещаться выбери исполнителя, для выполнения команд, затем выбери что ему выполнять.",
    "2":"В данном случае, персонаж Player должен перемещаться. Выбери команду move и затем укажи на сколько клеток ему переместиться. Для запуска кода нажми кнопку Запустить"
  },
  "2":{
    "0":"Впереди препятствие, через которое герою не пробраться. Обойдём его и остановимся в конце на обозначенной клетке",
    "1": "Для поворота воспользуйся командами Rotate Left - для поворота налево, Rotate Right - для поворота направо",
    "2": "Обрати внимание, что герой разворачивается на месте"
  },
  "3":{
    "0":"Теперь давай соберём сокровища, они пригодятся тебе в дальнейшем",
    "1":"Камень оказывается у тебя, когда ты проходишь через клетку с ним",
    "2":"После, остановись в обозначенной клетке"
  },
  "4":{
    "0":"На этом уровне тебе предстоит важная миссия, необходимо доставить предмет в обозначенную клетку",
    "1":"Чтобы подобрать предмет, воспользуйся Take на вкладке Actions, перед этим остановись в нужной клетке",
    "2":"Чтобы выложить предмет, используй команду Put в отмеченной штрихом клетке, в конце, остановись в финальной точке"
  },
  "5":{
    "0":"Теперь, давай вооружимся! Чтобы подобрать оружие, воспользуйся уже знакомой командой Take",
    "1":"Естественно, нужно находиться в клетке с оружием",
    "2":"В конце остановись в финальной точке"},
  "6":{
    "0":"Ночью ты просыпаешься от шума и понимаешь: 'НА НАС НАПАЛИ'.К тому моменту, когда ты выбежал во двор, то встретил всего одного орка, а  замок уже был ограблен. Ты понимаешь, что друг Олли пропал вместе с орками.(далее)",
    "1":" 'Видимо его забрали с собой'- ты моментально направляешься к орку чтобы его обездвижить и дальше приступить к поискам друга.(далее) ",
    "2":"Исользуя команду Attack обезвредь орка и после спрячься за башней (финиш - закрашенный зеленым цветом квадрат)"
  },
  "7":{
    "0":"После долгих странствий ты замечаешь орков, и у одного из них  выдитшь украденный ранее у вас кристалл. 'Значит я на правильном пути, пора вернуть рубин'",
    "1":"Не забывай - чтобы обездвижить стражника используй команду Attack, а также помни, что финиш - квадрат подсвеченный зеленым цветом",
    "2":"Работа и труд - все перетрут"
  },
  "8":{
    "0":"Наконец ты нашел, где прячут твоего друга Олли, на подступах к лагерю он тебя замечает и начинает бежать к тебе навстречу. Орки замечает это и направляется в вашу сторону. Остановите орков и встретьтесь с Олли на финише (далее)",
    "1":"Исользуя команду loop ты можешь выполнять неоднократно повторяющиеся действия, чем сократишь время написания кода и уменьшишь количество команд (смотри следующую подсказку) ",
    "2":"Не забывай - чтобы обездвижить орка используй команду attack, а также помни, что финиш - квадрат подсвеченный зеленым цветом "
  },
  "9":{
    "0":"Ура!!Вы вырвались, однако совсем скоро, другой отряд орков устроил вам засаду. Остановите их, защитите Олли!!!",
    "1":"Исользуя команду loop ты можешь выполнять неоднократно повторяющиеся действия, чем сократишь время написания кода и уменьшишь количество команд (далее) ",
    "2":"Повторение- мать учения"
  },
  "10":{
    "0":"Поздравляю!!! Надеюсь нам удалось сформировать твое представление о том, что программирование может быть интересным и увлекательным занятием, продолжай в том же духе и у тебя все получится!!",
    "1":"Но ты всегда можешь попробовать пройти эту игру снова",
    "2":"Или показать своим друзьям"
  }
}
